In [3]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("Data.csv")

In [3]:
data.head()

  City  Amt
0  Mum   10
1  Del   20
2  Del   30
3  Mum   20
4  Mum   30

In [118]:
data.shape

(5, 2)

In [120]:
data.dtypes

City    object
Amt      int64
dtype: object

In [4]:
data['City'].value_counts()

Mum    3
Del    2
Name: City, dtype: int64

In [5]:
cnt=len(data['City'].unique())
cnt

2

In [6]:
data['City'].nunique()

2

In [7]:
data['City'].tolist()

['Mum', 'Del', 'Del', 'Mum', 'Mum']

In [8]:
" ".join(data['City'].unique().tolist())

'Mum Del'

In [9]:
city_list=data.City.unique().tolist()
city_list

['Mum', 'Del']

In [81]:
# Filter datasets and then combine-- Create dataframe dynamically
df = {}
for x in city_list:
    df[x]=data[:][data.City == x]
    
df8=pd.concat(df)  
df

{'Mum':   City  Amt
 0  Mum   10
 3  Mum   20
 4  Mum   30,
 'Del':   City  Amt
 1  Del   20
 2  Del   30}

In [82]:
df8

      City  Amt
Mum 0  Mum   10
    3  Mum   20
    4  Mum   30
Del 1  Del   20
    2  Del   30

In [83]:
# Filter datasets and then combine-- Create dataframe dynamically
dataframes = []
for x in city_list:
    dataframes.append(data[:][data.City == x])
        
df7 = pd.concat(dataframes)

In [84]:
dataframes

[  City  Amt
 0  Mum   10
 3  Mum   20
 4  Mum   30,
   City  Amt
 1  Del   20
 2  Del   30]

In [85]:
df7

  City  Amt
0  Mum   10
3  Mum   20
4  Mum   30
1  Del   20
2  Del   30

In [111]:
# Count of words in python series with delimiter

initial_data = {'count': [4],
                'bkt': 'B5,B6,B7'
                }
 
df = pd.DataFrame(initial_data, columns = ['count', 'bkt'])
df

   count       bkt
0      4  B5,B6,B7

In [112]:
t=df['bkt'].str.split(",")
t

0    [B5, B6, B7]
Name: bkt, dtype: object

In [113]:
sum(pd.value_counts(t.apply(pd.Series).stack()))

3

In [114]:
max(df['bkt'].apply(lambda n: len(n.split(","))))

3

In [115]:
c=0
obj={}
for x in t.tolist()[0]:
    obj[x]=(t[0][c])
    c=c+1

In [116]:
obj

{'B5': 'B5', 'B6': 'B6', 'B7': 'B7'}

In [117]:
d7=pd.DataFrame.from_dict(obj,orient='index')
d7

     0
B5  B5
B6  B6
B7  B7

In [118]:
d7.to_dict()

{0: {'B5': 'B5', 'B6': 'B6', 'B7': 'B7'}}

In [ ]:
#Linux read multiple csv files and then combine in one dataframe

from pathlib import Path

dataframes = []
for p in Path("/path/to/data/").iterdir():
    if p.suffix == ".csv":
        dataframes.append(pd.read_csv(p))
        
df = pd.concat(dataframes)

#To include subdirectories

df = pd.concat([pd.read_csv(f) for f in path.glob("**/*.csv")], ignore_index = True)

In [ ]:
# Extract first element from multidimensional string

#[['This is sample1'],['This is sample2']]

# Replacing the pure "NaN" values with blank array

df['Reviews'].fillna('[[], []]',inplace=True)

# Extracting the reviews string from the data

df['Reviews'] = df['Reviews'].apply(ast.literal_eval).str[0].str.join(',')

In [89]:
def a():
    x=1
    return x

In [91]:
def b():
    x=2
    return x

In [115]:
z=2

In [117]:
if z==2:
    print(b())

2

In [123]:
# Create DataFrame

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', ' (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [124]:
#Split Column based on delimiter
df1 = df.copy()
df1[['From','To']] = df.From_To.str.split("_",expand=True)
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],(12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

In [125]:
# Convert column to Propcase
df1['From']=df1['From'].str.title()
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,paris
1,MAdrid_miLAN,NaN,[],(12),Madrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

In [128]:
# Drop Column
df.drop(columns=['From_To','RecentDelays'],inplace=True)
df


df.drop(['Unnamed: 0','ID_TA','URL_TA','Name'],axis=1,inplace=True)

   FlightNumber              Airline
0       10045.0               KLM(!)
1           NaN                 (12)
2       10065.0  (British Airways. )
3           NaN       12. Air France
4       10085.0          "Swiss Air"

In [130]:
#Rename Column

df.rename(columns={'FlightNumber':'Flight', 'Airline':'Air'}, inplace=True)
df

    Flight                  Air
0  10045.0               KLM(!)
1      NaN                 (12)
2  10065.0  (British Airways. )
3      NaN       12. Air France
4  10085.0          "Swiss Air"

In [ ]:
# Subset Data

titanic2=titanic.loc[titanic['Sex']=='male',['Name','Sex','Pclass']]

In [ ]:
# Sort Date

titanic.sort_values(by=['PassengerId'],ascending=False,inplace=True)

In [ ]:
# If then output

data titanic_a(keep=passengerid name sex) titanic_b(keep=passengerid age survived);
set titanic;
if (passengerid in (887,888,889,890,891)) then output titanic_a;
if (passengerid in (884,885,886,887,888)) then output titanic_b;
run;

titanic_a=titanic.loc[titanic['PassengerId'].isin([887,888,889,890,891]),['PassengerId','Name','Sex']]
titanic_b=titanic.loc[titanic['PassengerId'].isin([884,885,886,887,888]),['PassengerId','Age','Survived']]

In [ ]:
# Joins

data titanic_inner titanic_left_a titanic_outer;
merge titanic_a (in = a)titanic_b (in = b);
by descending passengerid;
if a and b then output titanic_inner;
if a then output titanic_left_a;
if a or b then output titanic_outer;
run;

titanic_inner=titanic_a.merge(titanic_b,how='inner',on='PassengerId')
titanic_left_a=titanic_a.merge(titanic_b,how='left',on='PassengerId')
titanic_outer=titanic_a.merge(titanic_b,how='outer',on='PassengerId')

# Join
left_df = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}, index=['K0', 'K1', 'K2']) 

right_df = pd.DataFrame({
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
}, index=['K0', 'K2', 'K3'])

left_df.join(right_df, how='outer')

pd.merge(left, right, how='outer', on=['key1', 'key2'])
pd.merge(left, right, how='left', on=['key1', 'key2'])

In [ ]:
# CASE WHEN in Python
# importing pandas
import pandas as pd
 
# Creating new dataframe
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'],
                'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'],
                'Marks': [12, 52, 36, 85, 23] }
 
df = pd.DataFrame(initial_data, columns = ['First_name', 'Last_name', 'Marks'])
 
# Generate result using pandas
# Method 1
result = []
for value in df["Marks"]:
    if value >= 33:
        result.append("Pass")
    elif value < 0 and value > 100:
        result.append("Invalid")
    else:
        result.append("Fail")
      
df["Result"] = result  
print(df)

# Method 2
df['Results'] = ['Pass' if m>=33 else 'Fail' for m in df['Marks']]
df

#Method 3

def price_band(x):
    for i in pr:
        if i == '$$$$':
            return 4
        elif i == '$':
            return 1
        elif i == '$$ - $$$':
            return 2.5
        elif i == '$$':
            return 2
        elif i == '$$$':
            return 3
        else:
            return 2.5
        
df['Price Range'] = df['Price Range'].apply(price_band)

In [ ]:
# Select all data except exclude list

Exclude_List = ['d3589386','d10681569','d717825','d1576770','d1982662']
df = df[~df['ID_TA'].isin(Exclude_List)]

In [ ]:
# Label Encoding the values by creating columns for each cities

for cols in top_city_names:
    df[cols + str('_City')]=np.where(df['City'] == cols, 1,0)

In [ ]:
# Label Encoding the values by creating columns for each Cuisine

Cuisine_List = ['Asian', 'Italian', 'French']

for cols in Cuisine_List:
    df[cols +str('_CUS')]=np.where(df['Cuisine Style'].str.contains(cols), 1,0)

In [ ]:
#Replace
df['Reviews'] =df['Reviews'].str.replace(('\W+'),' ')

In [ ]:
# Converting all the reviews to lower case 
df['Reviews'] =df['Reviews'].str.lower()

In [ ]:
# Removing the stop words
stop = stopwords.words('english')
df['Reviews'] =df['Reviews'].apply(lambda x: " ".join(x for x in x.split() if x not in stop))

In [ ]:
# Where clause

df = weather_df[(weather_df['Wind Spd (km/h)'] > 24) & (weather_df['Visibility (km)']== 25)]
df.head()

newdata = df[(df['Address'].str[0] == 'N') & (df['Age'] > 30)]
df1[col+'_outlier'] = np.where( (df1[col]>df1[col+'_upper']) | (df1[col]<df1[col+'_lower']) , 1, 0)

In [ ]:
#Pivot

data = {
    'A': ['foo','foo','foo','bar','bar','bar'],
    'B': ['one','one','two','two','one','one'],
    'C': ['x','y','x','y','x','y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

pivot_df = df.pivot_table(
                values='D',      # We want to aggregate the values of which column?
                index='A',       # We want to use which column as the new index?
                columns=['C'],   # We want to use the values of which column as the new columns? (optional)
                aggfunc=np.sum)  # What aggregation function to use ?


pivot_df

In [ ]:
# Concat dataframes
pd.concat([df1, df2, df3]) #rowise

pd.concat([df1, df2, df3], axis=1) #columnwise

In [107]:
# Concatenating columns horizontally
df1=df1[['From','To']]
df3=pd.concat([df,df1],axis=1)
df3

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      paris
1           NaN            []                 (12)    Madrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    London  StockhOlm
3           NaN          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [108]:
A = ['a', 'b', 'c']
B = [1, 2, 3]
C = ['t','e','r']

t = dict(zip(B,C))
t

{1: 't', 2: 'e', 3: 'r'}

In [111]:
Q =list(zip(A,C,B))
Q

[('a', 't', 1), ('b', 'e', 2), ('c', 'r', 3)]

In [112]:
x,y,z = zip(*Q)

In [113]:
x

('a', 'b', 'c')

In [114]:
list(x)

['a', 'b', 'c']

In [ ]:
# Remove Duplicates

In [26]:
data = {
    "A": ["TeamA", "TeamB", "TeamB", "TeamC", "TeamA","TeamC"],
    "B": [50, 40, 45, 30, 50,30],
    "C": [True, False, True, False, False,False]
}
  
df = pd.DataFrame(data)

In [27]:
df

       A   B      C
0  TeamA  50   True
1  TeamB  40  False
2  TeamB  45   True
3  TeamC  30  False
4  TeamA  50  False
5  TeamC  30  False

In [28]:
display(df.drop_duplicates())

       A   B      C
0  TeamA  50   True
1  TeamB  40  False
2  TeamB  45   True
3  TeamC  30  False
4  TeamA  50  False

In [29]:
display(df.drop_duplicates(subset="A",keep="last",inplace=False))

       A   B      C
2  TeamB  45   True
4  TeamA  50  False
5  TeamC  30  False

In [30]:
display(df.drop_duplicates(subset=["A","B"],keep="last",inplace=False))

       A   B      C
1  TeamB  40  False
2  TeamB  45   True
4  TeamA  50  False
5  TeamC  30  False

In [31]:
#Implode Explode

In [34]:
data = {'Name': ['John', 'Mike'], 'Items': [['apple', 'banana', 'orange'], ['car', 'bike']]}
df = pd.DataFrame(data)
df

   Name                    Items
0  John  [apple, banana, orange]
1  Mike              [car, bike]

In [35]:
df_explode = df.explode('Items')
df_explode

   Name   Items
0  John   apple
0  John  banana
0  John  orange
1  Mike     car
1  Mike    bike

In [37]:
df_implode = df_explode.groupby('Name', as_index=False).agg(lambda x: x.tolist())
df_implode

   Name                    Items
0  John  [apple, banana, orange]
1  Mike              [car, bike]

In [38]:
#Pivot Un-Pivot

In [39]:
data = {'Name': ['John', 'Mike', 'John', 'Mike'], 'Item': ['apple', 'car', 'banana', 'bike'], 'Quantity': [1, 2, 3, 4]}
df = pd.DataFrame(data)
df

   Name    Item  Quantity
0  John   apple         1
1  Mike     car         2
2  John  banana         3
3  Mike    bike         4

In [42]:
table = df.pivot_table( index='Name', columns='Item', values='Quantity', aggfunc='sum').fillna(0)
table

Item  apple  banana  bike  car
Name
John    1.0     3.0   0.0  0.0
Mike    0.0     0.0   4.0  2.0

In [43]:
data = {'Name': ['John', 'Mike'], 'Item1': ['apple', 'car'], 'Item2': ['banana', 'bike'], 'Item3': ['orange', 'bus']}
df = pd.DataFrame(data)
df

   Name  Item1   Item2   Item3
0  John  apple  banana  orange
1  Mike    car    bike     bus

In [44]:
df = df.melt(id_vars=['Name'], value_vars=['Item1', 'Item2', 'Item3'], var_name='Item Type', value_name='Item Name')
df

   Name Item Type Item Name
0  John     Item1     apple
1  Mike     Item1       car
2  John     Item2    banana
3  Mike     Item2      bike
4  John     Item3    orange
5  Mike     Item3       bus

In [45]:
# Stack Un-Stack

In [47]:
df_stack = table.stack()
df_stack

Name  Item
John  apple     1.0
      banana    3.0
      bike      0.0
      car       0.0
Mike  apple     0.0
      banana    0.0
      bike      4.0
      car       2.0
dtype: float64

In [48]:
df_unstack = df_stack.unstack()
df_unstack

Item  apple  banana  bike  car
Name
John    1.0     3.0   0.0  0.0
Mike    0.0     0.0   4.0  2.0

In [49]:
#Crosstab

In [50]:
data = {'Name': ['John', 'Mike', 'John', 'Mike'], 'Item': ['apple', 'car', 'banana', 'bike'], 'Quantity': [1, 2, 3, 4]}
df = pd.DataFrame(data)
df

   Name    Item  Quantity
0  John   apple         1
1  Mike     car         2
2  John  banana         3
3  Mike    bike         4

In [51]:
pd.crosstab(df['Name'], df['Item'])

Item  apple  banana  bike  car
Name
John      1       1     0    0
Mike      0       0     1    1

In [52]:
#Binning Un Binning

In [53]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]})
df

    A
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [54]:
bins = [0, 3, 6, 10]
df['binned_A'] = pd.cut(df['A'], bins)
df

    A binned_A
0   1   (0, 3]
1   2   (0, 3]
2   3   (0, 3]
3   4   (3, 6]
4   5   (3, 6]
5   6   (3, 6]
6   7  (6, 10]
7   8  (6, 10]
8   9  (6, 10]
9  10  (6, 10]

In [55]:
df['binned_A_qcut'] = pd.qcut(df['A'], 3)
df

    A binned_A binned_A_qcut
0   1   (0, 3]  (0.999, 4.0]
1   2   (0, 3]  (0.999, 4.0]
2   3   (0, 3]  (0.999, 4.0]
3   4   (3, 6]  (0.999, 4.0]
4   5   (3, 6]    (4.0, 7.0]
5   6   (3, 6]    (4.0, 7.0]
6   7  (6, 10]    (4.0, 7.0]
7   8  (6, 10]   (7.0, 10.0]
8   9  (6, 10]   (7.0, 10.0]
9  10  (6, 10]   (7.0, 10.0]

In [1]:
#Dynamic column addition

In [4]:
data = np.random.randint(100, size=(10,3))
df = pd.DataFrame(data=data,columns=['A','B','C'])
df

    A   B   C
0  49  31  88
1  57  88  64
2  18  75  63
3   1  31  60
4  50  34  17
5  80  58  85
6  12  40  79
7  62  75  88
8  67  47  98
9  78  13  82

In [5]:
df['(A+B+C)'] = df.sum(axis=1)
df

    A   B   C  (A+B+C)
0  49  31  88      168
1  57  88  64      209
2  18  75  63      156
3   1  31  60       92
4  50  34  17      101
5  80  58  85      223
6  12  40  79      131
7  62  75  88      225
8  67  47  98      212
9  78  13  82      173

In [6]:
columns_list = ['B', 'C']

In [7]:
df['(B+C)'] = df[columns_list].sum(axis=1)
df

    A   B   C  (A+B+C)  (B+C)
0  49  31  88      168    119
1  57  88  64      209    152
2  18  75  63      156    138
3   1  31  60       92     91
4  50  34  17      101     51
5  80  58  85      223    143
6  12  40  79      131    119
7  62  75  88      225    163
8  67  47  98      212    145
9  78  13  82      173     95

In [8]:
data = np.random.randint(100, size=(10,4))
df = pd.DataFrame(data=data,columns=['A1','A2','A3','B'])
df

   A1  A2  A3   B
0  71  72  91  64
1  32  49   3  61
2  98  58  50  20
3  92  58  53  82
4  76  96  69  32
5  43  58  68  94
6  21  19  48   8
7  25  20  38  38
8  71  61  63  70
9  39  16  30  24

In [11]:
var = [col for col in df.columns if 'A' in col]
var

['A1', 'A2', 'A3']

In [12]:
df['(A*)'] = df[var].sum(axis=1)
df

   A1  A2  A3   B  (A*)
0  71  72  91  64   234
1  32  49   3  61    84
2  98  58  50  20   206
3  92  58  53  82   203
4  76  96  69  32   241
5  43  58  68  94   169
6  21  19  48   8    88
7  25  20  38  38    83
8  71  61  63  70   195
9  39  16  30  24    85